//=============================================================================
//
// デバッグオブジェクト処理 [debugobject.cpp]
// Author : GP12A295 25 人見友基
//
//=============================================================================
#include "main.h"
#include "debugobject.h"

// デバッグ用
#ifdef _DEBUG
#include "debugproc.h"
#endif

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************

//*****************************************************************************
// グローバル変数
//*****************************************************************************
DebugSphere*	DebugObject::pSphere = NULL;
bool			DebugObject::s_bUse = true;

//=============================================================================
// コンストラクタ（初期化処理）
//=============================================================================
DebugObject::DebugObject(void)
{
	// オブジェクトIDとプライオリティの設定処理
	SetIdAndPriority(ObjectID::DEBUGOBJECT, Priority::Low, Priority::Low);

	pSphere = NULL;
	pSphere = new DebugSphere;
}

//=============================================================================
// デストラクタ（終了処理）
//=============================================================================
DebugObject::~DebugObject(void)
{
	SAFE_DELETE(pSphere);
}

//=============================================================================
// 更新処理
//=============================================================================
void DebugObject::Update(void)
{
#ifdef _DEBUG
	ImGui::SetNextTreeNodeOpen(false, ImGuiSetCond_Once);
	bool bGui = ImGui::TreeNode("DebugObject");
	if (bGui)
	{
		if (ImGui::Button("Draw"))
			s_bUse = s_bUse ? false : true;
		ImGui::TreePop();
	}
#endif
	SAFE_UPDATE(pSphere);
}

//=============================================================================
// 描画処理
//=============================================================================
void DebugObject::Draw(void)
{
	if (s_bUse)
	{
		SAFE_DRAW(pSphere);
	}
}