//=============================================================================
//
// ゲーム処理 [game.cpp]
// Author : GP12A295 25 人見友基
//
//=============================================================================
#include "game.h"

/* 全体で必要なインクルード */
#include "input.h"
#include "camera.h"
#include "sound.h"

/* ゲームで必要なインクルード */
#include "fade.h"
#include "player.h"
#include "enemy.h"
#include "stage.h"
#include "effect.h"

/* デバッグ */
#ifdef _DEBUG
#include "debugproc.h"
#include "debugobject.h"
#endif

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************

//*****************************************************************************
// グローバル変数
//*****************************************************************************
int GameScene::m_nWave = 0;

//=============================================================================
// 更新処理
//=============================================================================
void GameScene::Update(void)
{
#ifdef _DEBUG
	// imguiの更新開始
	ImGui::Begin("GameScene");
	ImGui::Text("Wave[%d]\n", GameScene::m_nWave);
	if (ImGui::Button("WaveAdd"))
		GameScene::m_nWave++;
	// imguiの更新終了
	ImGui::End();
#endif
	ObjectManager::UpdateAll();
}

//=============================================================================
// 描画処理
//=============================================================================
void GameScene::Draw(void)
{
	ObjectManager::DrawAll();
}

//=============================================================================
// コンストラクタ処理（初期化）
//=============================================================================
GameScene::GameScene(void)
{
	m_nWave = 0;
#ifdef _DEBUG
	ObjectManager::CreateObject<DebugObject>();
#endif
	ObjectManager::CreateObject<EnemyManager>();
	ObjectManager::CreateObject<PlayerManager>();
	ObjectManager::CreateObject<Stage>();
	ObjectManager::CreateObject<EffectManager>();
}

//=============================================================================
// デストラクタ処理（終了）
//=============================================================================
GameScene::~GameScene(void)
{
	ObjectManager::ReleaseAll();
}

//=============================================================================
// ゲーム停止メソッド
//=============================================================================
bool GameScene::GameStop(void)
{
	return 0;
}