//=============================================================================
//
// ステンシル処理 [stencil.h]
// Author : GP12A295 25 人見友基
//
//=============================================================================
#ifndef _STENCIL_H_
#define _STENCIL_H_

/*******************************************************************************
* インクルード
*******************************************************************************/
#include "object.h"
#include "XTexture.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
// モデル
#define	STENCIL_TEXTURE		"data/TEXTURE/condition.png"	// 読み込むモデル名
#define	STENCIL_TEXTURE2	"data/TEXTURE/sky1.jpg"	// 読み込むモデル名


// モデルの最大数
#define MODEL_STENCIL_MAX			(1)

// モデルスケール
#define MODEL_STENCIL_SCL			(30.0f)

//*****************************************************************************
// 構造体定義
//*****************************************************************************

//*****************************************************************************
// クラス定義
//*****************************************************************************

class Stencil : public ObjectManager
{
private:
	CXTexture		m_CXTexture;		// テクスチャ格納用
	//CXTexture		m_CXTexture2;		// テクスチャ格納用
	bool			m_bUse;				// 使用フラグ
public:
	enum STENCIL
	{	// プレイヤー管理
		STENCIL_MAIN,
		STENCIL_MAX
	};

	// コンストラクタ（初期化処理）
	Stencil(void);
	//デストラクタ（終了処理）
	~Stencil(void);

	// 更新処理
	void	Update(void);
	// 描画処理
	void	Draw(void);
private:

};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************

#endif
