//=============================================================================
//
// モデル処理 [XModel.h]
// Author : GP12A295 25 人見友基
//
//=============================================================================
#ifndef _XMODEL_H_
#define _XMODEL_H_

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 構造体定義
//*****************************************************************************

//*****************************************************************************
// クラス定義
//*****************************************************************************
// スキンメッシュクラス
class CXModel
{
private:
	// シェーダー関連
	LPD3DXEFFECT		pEffect;

	LPDIRECT3DTEXTURE9	*ppTexture;		// テクスチャへのポインタ
	LPD3DXMESH			pMesh;			// メッシュ情報へのポインタ
	LPD3DXBUFFER		pBuffMat;		// マテリアル情報へのポインタ
	DWORD				dwNumMat;		// マテリアル情報の数
	bool				bLight;
public:
	// コンストラクタ
	CXModel();
	// デストラクタ
	~CXModel() { Release(); }

	// スキンメッシュ内部処理
	HRESULT Init(LPDIRECT3DDEVICE9, LPSTR, LPSTR);
	// 解放処理
	void Release();
	// 更新処理
	void Update(void);
	// 描画処理
	void Draw(D3DXMATRIX);
	// ライト設定処理
	void SetLight(bool bUse) { bLight = bUse; }
	void SetMaterialSpecular(float speclar, float power);
};
#endif