//=============================================================================
//
// 2Dテクスチャ処理 [XTexture.h]
// Author : GP12A295 25 人見友基
//
//=============================================================================
#ifndef _XTEXTURE_H_
#define _XTEXTURE_H_

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 構造体定義
//*****************************************************************************

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CXTexture
{
private:
	LPDIRECT3DTEXTURE9	m_pD3DTexture;		// テクスチャへのポインタ
	LPDIRECT3DTEXTURE9	m_pD3DTexture2;		// テクスチャへのポインタ
	VERTEX_2D	m_VertexWk[NUM_VERTEX];		// 2D頂点情報

	typedef struct XTextureData
	{
		typedef struct Divide
		{
			int x, y;
		};
		D3DXVECTOR2		vPos;
		D3DXVECTOR2		vSize;
		Divide			nDivide;
		D3DXCOLOR		xColor;
		int				nTexNum;
	};

	// 頂点の作成
	HRESULT MakeVertex(void);

public:
	XTextureData data;

	// コンストラクタ
	CXTexture();
	// デストラクタ
	~CXTexture() { Release(); }

	// スキンメッシュ内部処理
	HRESULT Init(LPDIRECT3DDEVICE9, LPSTR);
	// 解放処理
	void Release();
	// 更新処理
	void Update(void);
	// 描画処理
	void Draw(void);
	// 頂点の作成
	HRESULT SetVertex(void);
};
#endif